<a href="https://colab.research.google.com/github/GabrielCondori22/GabrielCondori22/blob/main/ejercicio1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [54]:
import pandas as pd

In [55]:
datos = pd.read_csv("https://docs.google.com/spreadsheets/d/e/2PACX-1vT26poP6_8ojH9daKjBUIEpeMYfYMO7fXcOCbasoYtabuDStyPQzmAOwEND0c4sebwLD3vnFe6pRSoh/pub?output=csv")

In [57]:
print(datos)

       nombre  edad    ciudad  ingresos
0        Juan    30      Lima      2500
1       María    28  Arequipa      3800
2        Luis    35     Cusco      4800
3         Ana    22  Trujillo      2000
4       Pedro    28  Arequipa      3200
5      Leonel    64   Juliaca      4980
6       Laura    31      Lima      4200
7      Carlos    25     Cusco      1800
8       Sofía    29  Trujillo      2900
9      Andrés    27      Lima      2600
10   Gabriela    33  Arequipa      4000
11    Micaela    21   Juliaca      5000
12      Diego    24     Cusco      3200
13  Valentina    26  Trujillo      3500
14     Lorena    30      Lima      3800
15     Javier    32  Arequipa      5000
16    Daniela    29      Lima      2700
17     Manuel    31  Trujillo      2700
18   Fernanda    28     Cusco      2100
19    Ricardo    35      Lima      4400
20      Lucía    23  Trujillo      1500
21       José    34  Arequipa      4200
22      Willy    55      Puno      1300

In [38]:
#Obtenemos la suma total de la columna ingresos
suma_ingresos = datos['ingresos'].sum()
print("La suma de la columna ingresos es ", suma_ingresos)

La suma de la columna ingresos es  76180

In [39]:
#Obtenemos el promedio de las edad de la persona de la lista
promedio_edad = datos['edad'].mean()
print("El promedio de edad es ", int(promedio_edad))

El promedio de edad es  31

In [48]:
#Filtro por ciudad, "Arequipa"
arequipa_df = datos[datos['ciudad'] == 'Arequipa']
print(arequipa_df)

      nombre  edad    ciudad  ingresos
1      María    28  Arequipa      3800
4      Pedro    28  Arequipa      3200
10  Gabriela    33  Arequipa      4000
15    Javier    32  Arequipa      5000
21      José    34  Arequipa      4200

In [47]:
#Promedio de ingresos por ciudad
promedio_ingresos_por_ciudad = df.groupby('ciudad')['ingresos'].mean().astype(int);
print(promedio_ingresos_por_ciudad)

ciudad
Arequipa    4040
Cusco       2975
Juliaca     4990
Lima        3366
Puno        1300
Trujillo    2520
Name: ingresos, dtype: int64

In [65]:
#Persona mas joven y mas mayor
joven=datos.loc[datos['edad']==datos['edad'].min(), "nombre"].values[0]
print(joven);
mayor=datos.loc[datos['edad']==datos['edad'].max(), "nombre"].values[0]
print(mayor);

Micaela
Leonel

In [64]:
#Persona mas joven y mas mayor
joven=datos.loc[datos['edad']==datos['edad'].min()].values[0]
print(joven);
mayor=datos.loc[datos['edad']==datos['edad'].max()].values[0]
print(mayor);

['Micaela' 21 'Juliaca' 5000]
['Leonel' 64 'Juliaca' 4980]

In [71]:
#Obtenemos el numero de personas por ciudad - Modo 1
personas_por_ciudades=datos.groupby("ciudad")["nombre"].count()
print(personas_por_ciudades)

ciudad
Arequipa    5
Cusco       4
Juliaca     2
Lima        6
Puno        1
Trujillo    5
Name: nombre, dtype: int64

In [68]:
#Obtenemos el numero de personas por ciudad - Modo 2
trabajadores_por_ciudad = datos['ciudad'].value_counts()
total_trabajadores = trabajadores_por_ciudad.sum()
print(trabajadores_por_ciudad)
print("\nTotal de trabajadores:", total_trabajadores)

Lima        6
Arequipa    5
Trujillo    5
Cusco       4
Juliaca     2
Puno        1
Name: ciudad, dtype: int64

Total de trabajadores: 23

In [72]:
#Orden por edad de forma descendente
df_ordenado_por_edad_descendente = datos.sort_values(by='edad', ascending=False)
print(df_ordenado_por_edad_descendente)

       nombre  edad    ciudad  ingresos
5      Leonel    64   Juliaca      4980
22      Willy    55      Puno      1300
2        Luis    35     Cusco      4800
19    Ricardo    35      Lima      4400
21       José    34  Arequipa      4200
10   Gabriela    33  Arequipa      4000
15     Javier    32  Arequipa      5000
6       Laura    31      Lima      4200
17     Manuel    31  Trujillo      2700
14     Lorena    30      Lima      3800
0        Juan    30      Lima      2500
8       Sofía    29  Trujillo      2900
16    Daniela    29      Lima      2700
1       María    28  Arequipa      3800
18   Fernanda    28     Cusco      2100
4       Pedro    28  Arequipa      3200
9      Andrés    27      Lima      2600
13  Valentina    26  Trujillo      3500
7      Carlos    25     Cusco      1800
12      Diego    24     Cusco      3200
20      Lucía    23  Trujillo      1500
3         Ana    22  Trujillo      2000
11    Micaela    21   Juliaca      5000